GopalSaraf/Practicals/PSDL/include/proc/pic18lf14k50.inc
// Register: IOCB
#define IOCB IOCB
IOCB                                     equ 0F7Ah
// bitfield definitions
IOCB_IOCB4_POSN                          equ 0004h
IOCB_IOCB4_POSITION                      equ 0004h
IOCB_IOCB4_SIZE                          equ 0001h
IOCB_IOCB4_LENGTH                        equ 0001h
IOCB_IOCB4_MASK                          equ 0010h
IOCB_IOCB5_POSN                          equ 0005h
IOCB_IOCB5_POSITION                      equ 0005h
IOCB_IOCB5_SIZE                          equ 0001h
IOCB_IOCB5_LENGTH                        equ 0001h
IOCB_IOCB5_MASK                          equ 0020h
IOCB_IOCB6_POSN                          equ 0006h
IOCB_IOCB6_POSITION                      equ 0006h
IOCB_IOCB6_SIZE                          equ 0001h
IOCB_IOCB6_LENGTH                        equ 0001h
IOCB_IOCB6_MASK                          equ 0040h
IOCB_IOCB7_POSN                          equ 0007h
IOCB_IOCB7_POSITION                      equ 0007h
IOCB_IOCB7_SIZE                          equ 0001h
IOCB_IOCB7_LENGTH                        equ 0001h
IOCB_IOCB7_MASK                          equ 0080h

// Register: ANSEL
#define ANSEL ANSEL
ANSEL                                    equ 0F7Eh
// bitfield definitions
ANSEL_ANS3_POSN                          equ 0003h
ANSEL_ANS3_POSITION                      equ 0003h
ANSEL_ANS3_SIZE                          equ 0001h
ANSEL_ANS3_LENGTH                        equ 0001h
ANSEL_ANS3_MASK                          equ 0008h
ANSEL_ANS4_POSN                          equ 0004h
ANSEL_ANS4_POSITION                      equ 0004h
ANSEL_ANS4_SIZE                          equ 0001h
ANSEL_ANS4_LENGTH                        equ 0001h
ANSEL_ANS4_MASK                          equ 0010h
ANSEL_ANS5_POSN                          equ 0005h
ANSEL_ANS5_POSITION                      equ 0005h
ANSEL_ANS5_SIZE                          equ 0001h
ANSEL_ANS5_LENGTH                        equ 0001h
ANSEL_ANS5_MASK                          equ 0020h
ANSEL_ANS6_POSN                          equ 0006h
ANSEL_ANS6_POSITION                      equ 0006h
ANSEL_ANS6_SIZE                          equ 0001h
ANSEL_ANS6_LENGTH                        equ 0001h
ANSEL_ANS6_MASK                          equ 0040h
ANSEL_ANS7_POSN                          equ 0007h
ANSEL_ANS7_POSITION                      equ 0007h
ANSEL_ANS7_SIZE                          equ 0001h
ANSEL_ANS7_LENGTH                        equ 0001h
ANSEL_ANS7_MASK                          equ 0080h

// Register: ANSELH
#define ANSELH ANSELH
ANSELH                                   equ 0F7Fh
// bitfield definitions
ANSELH_ANS8_POSN                         equ 0000h
ANSELH_ANS8_POSITION                     equ 0000h
ANSELH_ANS8_SIZE                         equ 0001h
ANSELH_ANS8_LENGTH                       equ 0001h
ANSELH_ANS8_MASK                         equ 0001h
ANSELH_ANS9_POSN                         equ 0001h
ANSELH_ANS9_POSITION                     equ 0001h
ANSELH_ANS9_SIZE                         equ 0001h
ANSELH_ANS9_LENGTH                       equ 0001h
ANSELH_ANS9_MASK                         equ 0002h
ANSELH_ANS10_POSN                        equ 0002h
ANSELH_ANS10_POSITION                    equ 0002h
ANSELH_ANS10_SIZE                        equ 0001h
ANSELH_ANS10_LENGTH                      equ 0001h
ANSELH_ANS10_MASK                        equ 0004h
ANSELH_ANS11_POSN                        equ 0003h
ANSELH_ANS11_POSITION                    equ 0003h
ANSELH_ANS11_SIZE                        equ 0001h
ANSELH_ANS11_LENGTH                      equ 0001h
ANSELH_ANS11_MASK                        equ 0008h

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 0F80h
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA5_POSN                           equ 0005h
PORTA_RA5_POSITION                       equ 0005h
PORTA_RA5_SIZE                           equ 0001h
PORTA_RA5_LENGTH                         equ 0001h
PORTA_RA5_MASK                           equ 0020h
PORTA_AN3_POSN                           equ 0004h
PORTA_AN3_POSITION                       equ 0004h
PORTA_AN3_SIZE                           equ 0001h
PORTA_AN3_LENGTH                         equ 0001h
PORTA_AN3_MASK                           equ 0010h
PORTA_OSC2_POSN                          equ 0004h
PORTA_OSC2_POSITION                      equ 0004h
PORTA_OSC2_SIZE                          equ 0001h
PORTA_OSC2_LENGTH                        equ 0001h
PORTA_OSC2_MASK                          equ 0010h
PORTA_OSC1_POSN                          equ 0005h
PORTA_OSC1_POSITION                      equ 0005h
PORTA_OSC1_SIZE                          equ 0001h
PORTA_OSC1_LENGTH                        equ 0001h
PORTA_OSC1_MASK                          equ 0020h
PORTA_CLKOUT_POSN                        equ 0004h
PORTA_CLKOUT_POSITION                    equ 0004h
PORTA_CLKOUT_SIZE                        equ 0001h
PORTA_CLKOUT_LENGTH                      equ 0001h
PORTA_CLKOUT_MASK                        equ 0010h
PORTA_CLKIN_POSN                         equ 0005h
PORTA_CLKIN_POSITION                     equ 0005h
PORTA_CLKIN_SIZE                         equ 0001h
PORTA_CLKIN_LENGTH                       equ 0001h
PORTA_CLKIN_MASK                         equ 0020h
PORTA_ULPWUIN_POSN                       equ 0000h
PORTA_ULPWUIN_POSITION                   equ 0000h
PORTA_ULPWUIN_SIZE                       equ 0001h
PORTA_ULPWUIN_LENGTH                     equ 0001h
PORTA_ULPWUIN_MASK                       equ 0001h
PORTA_LVDIN_POSN                         equ 0005h
PORTA_LVDIN_POSITION                     equ 0005h
PORTA_LVDIN_SIZE                         equ 0001h
PORTA_LVDIN_LENGTH                       equ 0001h
PORTA_LVDIN_MASK                         equ 0020h

// Register: PORTB
#define PORTB PORTB
PORTB                                    equ 0F81h
// bitfield definitions
PORTB_RB4_POSN                           equ 0004h
PORTB_RB4_POSITION                       equ 0004h
PORTB_RB4_SIZE                           equ 0001h
PORTB_RB4_LENGTH                         equ 0001h
PORTB_RB4_MASK                           equ 0010h
PORTB_RB5_POSN                           equ 0005h
PORTB_RB5_POSITION                       equ 0005h
PORTB_RB5_SIZE                           equ 0001h
PORTB_RB5_LENGTH                         equ 0001h
PORTB_RB5_MASK                           equ 0020h
PORTB_RB6_POSN                           equ 0006h
PORTB_RB6_POSITION                       equ 0006h
PORTB_RB6_SIZE                           equ 0001h
PORTB_RB6_LENGTH                         equ 0001h
PORTB_RB6_MASK                           equ 0040h
PORTB_RB7_POSN                           equ 0007h
PORTB_RB7_POSITION                       equ 0007h
PORTB_RB7_SIZE                           equ 0001h
PORTB_RB7_LENGTH                         equ 0001h
PORTB_RB7_MASK                           equ 0080h
PORTB_SDI_POSN                           equ 0004h
PORTB_SDI_POSITION                       equ 0004h
PORTB_SDI_SIZE                           equ 0001h
PORTB_SDI_LENGTH                         equ 0001h
PORTB_SDI_MASK                           equ 0010h
PORTB_RX_POSN                            equ 0005h
PORTB_RX_POSITION                        equ 0005h
PORTB_RX_SIZE                            equ 0001h
PORTB_RX_LENGTH                          equ 0001h
PORTB_RX_MASK                            equ 0020h
PORTB_SCL_POSN                           equ 0006h
PORTB_SCL_POSITION                       equ 0006h
PORTB_SCL_SIZE                           equ 0001h
PORTB_SCL_LENGTH                         equ 0001h
PORTB_SCL_MASK                           equ 0040h
PORTB_TX_POSN                            equ 0007h
PORTB_TX_POSITION                        equ 0007h
PORTB_TX_SIZE                            equ 0001h
PORTB_TX_LENGTH                          equ 0001h
PORTB_TX_MASK                            equ 0080h
PORTB_SDA_POSN                           equ 0004h
PORTB_SDA_POSITION                       equ 0004h
PORTB_SDA_SIZE                           equ 0001h
PORTB_SDA_LENGTH                         equ 0001h
PORTB_SDA_MASK                           equ 0010h
PORTB_DT_POSN                            equ 0005h
PORTB_DT_POSITION                        equ 0005h
PORTB_DT_SIZE                            equ 0001h
PORTB_DT_LENGTH                          equ 0001h
PORTB_DT_MASK                            equ 0020h
PORTB_SCK_POSN                           equ 0006h
PORTB_SCK_POSITION                       equ 0006h
PORTB_SCK_SIZE                           equ 0001h
PORTB_SCK_LENGTH                         equ 0001h
PORTB_SCK_MASK                           equ 0040h
PORTB_CK_POSN                            equ 0007h
PORTB_CK_POSITION                        equ 0007h
PORTB_CK_SIZE                            equ 0001h
PORTB_CK_LENGTH                          equ 0001h
PORTB_CK_MASK                            equ 0080h
PORTB_AN10_POSN                          equ 0004h
PORTB_AN10_POSITION                      equ 0004h
PORTB_AN10_SIZE                          equ 0001h
PORTB_AN10_LENGTH                        equ 0001h
PORTB_AN10_MASK                          equ 0010h
PORTB_AN11_POSN                          equ 0005h
PORTB_AN11_POSITION                      equ 0005h
PORTB_AN11_SIZE                          equ 0001h
PORTB_AN11_LENGTH                        equ 0001h
PORTB_AN11_MASK                          equ 0020h

// Register: PORTC
#define PORTC PORTC
PORTC                                    equ 0F82h
// bitfield definitions
PORTC_RC0_POSN                           equ 0000h
PORTC_RC0_POSITION                       equ 0000h
PORTC_RC0_SIZE                           equ 0001h
PORTC_RC0_LENGTH                         equ 0001h
PORTC_RC0_MASK                           equ 0001h
PORTC_RC1_POSN                           equ 0001h
PORTC_RC1_POSITION                       equ 0001h
PORTC_RC1_SIZE                           equ 0001h
PORTC_RC1_LENGTH                         equ 0001h
PORTC_RC1_MASK                           equ 0002h
PORTC_RC2_POSN                           equ 0002h
PORTC_RC2_POSITION                       equ 0002h
PORTC_RC2_SIZE                           equ 0001h
PORTC_RC2_LENGTH                         equ 0001h
PORTC_RC2_MASK                           equ 0004h
PORTC_RC3_POSN                           equ 0003h
PORTC_RC3_POSITION                       equ 0003h
PORTC_RC3_SIZE                           equ 0001h
PORTC_RC3_LENGTH                         equ 0001h
PORTC_RC3_MASK                           equ 0008h
PORTC_RC4_POSN                           equ 0004h
PORTC_RC4_POSITION                       equ 0004h
PORTC_RC4_SIZE                           equ 0001h
PORTC_RC4_LENGTH                         equ 0001h
PORTC_RC4_MASK                           equ 0010h
PORTC_RC5_POSN                           equ 0005h
PORTC_RC5_POSITION                       equ 0005h
PORTC_RC5_SIZE                           equ 0001h
PORTC_RC5_LENGTH                         equ 0001h
PORTC_RC5_MASK                           equ 0020h
PORTC_RC6_POSN                           equ 0006h
PORTC_RC6_POSITION                       equ 0006h
PORTC_RC6_SIZE                           equ 0001h
PORTC_RC6_LENGTH                         equ 0001h
PORTC_RC6_MASK                           equ 0040h
PORTC_RC7_POSN                           equ 0007h
PORTC_RC7_POSITION                       equ 0007h
PORTC_RC7_SIZE                           equ 0001h
PORTC_RC7_LENGTH                         equ 0001h
PORTC_RC7_MASK                           equ 0080h
PORTC_AN4_POSN                           equ 0000h
PORTC_AN4_POSITION                       equ 0000h
PORTC_AN4_SIZE                           equ 0001h
PORTC_AN4_LENGTH                         equ 0001h
PORTC_AN4_MASK                           equ 0001h
PORTC_AN5_POSN                           equ 0001h
PORTC_AN5_POSITION                       equ 0001h
PORTC_AN5_SIZE                           equ 0001h
PORTC_AN5_LENGTH                         equ 0001h
PORTC_AN5_MASK                           equ 0002h
PORTC_AN6_POSN                           equ 0002h
PORTC_AN6_POSITION                       equ 0002h
PORTC_AN6_SIZE                           equ 0001h
PORTC_AN6_LENGTH                         equ 0001h
PORTC_AN6_MASK                           equ 0004h
PORTC_AN7_POSN                           equ 0003h
PORTC_AN7_POSITION                       equ 0003h
PORTC_AN7_SIZE                           equ 0001h
PORTC_AN7_LENGTH                         equ 0001h
PORTC_AN7_MASK                           equ 0008h
PORTC_AN8_POSN                           equ 0006h
PORTC_AN8_POSITION                       equ 0006h
PORTC_AN8_SIZE                           equ 0001h
PORTC_AN8_LENGTH                         equ 0001h
PORTC_AN8_MASK                           equ 0040h
PORTC_AN9_POSN                           equ 0007h
PORTC_AN9_POSITION                       equ 0007h
PORTC_AN9_SIZE                           equ 0001h
PORTC_AN9_LENGTH                         equ 0001h
PORTC_AN9_MASK                           equ 0080h
PORTC_NOT_SS_POSN                        equ 0006h
PORTC_NOT_SS_POSITION                    equ 0006h
PORTC_NOT_SS_SIZE                        equ 0001h
PORTC_NOT_SS_LENGTH                      equ 0001h
PORTC_NOT_SS_MASK                        equ 0040h
PORTC_C12INP_POSN                        equ 0000h
PORTC_C12INP_POSITION                    equ 0000h
PORTC_C12INP_SIZE                        equ 0001h
PORTC_C12INP_LENGTH                      equ 0001h
PORTC_C12INP_MASK                        equ 0001h
PORTC_C12IN1M_POSN                       equ 0001h
PORTC_C12IN1M_POSITION                   equ 0001h
PORTC_C12IN1M_SIZE                       equ 0001h
PORTC_C12IN1M_LENGTH                     equ 0001h
PORTC_C12IN1M_MASK                       equ 0002h
PORTC_C12IN2M_POSN                       equ 0002h
PORTC_C12IN2M_POSITION                   equ 0002h
PORTC_C12IN2M_SIZE                       equ 0001h
PORTC_C12IN2M_LENGTH                     equ 0001h
PORTC_C12IN2M_MASK                       equ 0004h
PORTC_C12IN3M_POSN                       equ 0003h
PORTC_C12IN3M_POSITION                   equ 0003h
PORTC_C12IN3M_SIZE                       equ 0001h
PORTC_C12IN3M_LENGTH                     equ 0001h
PORTC_C12IN3M_MASK                       equ 0008h
PORTC_C12OUT_POSN                        equ 0004h
PORTC_C12OUT_POSITION                    equ 0004h
PORTC_C12OUT_SIZE                        equ 0001h
PORTC_C12OUT_LENGTH                      equ 0001h
PORTC_C12OUT_MASK                        equ 0010h
PORTC_CCP1_POSN                          equ 0005h
PORTC_CCP1_POSITION                      equ 0005h
PORTC_CCP1_SIZE                          equ 0001h
PORTC_CCP1_LENGTH                        equ 0001h
PORTC_CCP1_MASK                          equ 0020h
PORTC_nSS_POSN                           equ 0006h
PORTC_nSS_POSITION                       equ 0006h
PORTC_nSS_SIZE                           equ 0001h
PORTC_nSS_LENGTH                         equ 0001h
PORTC_nSS_MASK                           equ 0040h
PORTC_INT0_POSN                          equ 0000h
PORTC_INT0_POSITION                      equ 0000h
PORTC_INT0_SIZE                          equ 0001h
PORTC_INT0_LENGTH                        equ 0001h
PORTC_INT0_MASK                          equ 0001h
PORTC_INT1_POSN                          equ 0001h
PORTC_INT1_POSITION                      equ 0001h
PORTC_INT1_SIZE                          equ 0001h
PORTC_INT1_LENGTH                        equ 0001h
PORTC_INT1_MASK                          equ 0002h
PORTC_INT2_POSN                          equ 0002h
PORTC_INT2_POSITION                      equ 0002h
PORTC_INT2_SIZE                          equ 0001h
PORTC_INT2_LENGTH                        equ 0001h
PORTC_INT2_MASK                          equ 0004h
PORTC_PGM_POSN                           equ 0003h
PORTC_PGM_POSITION                       equ 0003h
PORTC_PGM_SIZE                           equ 0001h
PORTC_PGM_LENGTH                         equ 0001h
PORTC_PGM_MASK                           equ 0008h
PORTC_SRQ_POSN                           equ 0004h
PORTC_SRQ_POSITION                       equ 0004h
PORTC_SRQ_SIZE                           equ 0001h
PORTC_SRQ_LENGTH                         equ 0001h
PORTC_SRQ_MASK                           equ 0010h
PORTC_T0CKI_POSN                         equ 0005h
PORTC_T0CKI_POSITION                     equ 0005h
PORTC_T0CKI_SIZE                         equ 0001h
PORTC_T0CKI_LENGTH                       equ 0001h
PORTC_T0CKI_MASK                         equ 0020h
PORTC_T13CKI_POSN                        equ 0006h
PORTC_T13CKI_POSITION                    equ 0006h
PORTC_T13CKI_SIZE                        equ 0001h
PORTC_T13CKI_LENGTH                      equ 0001h
PORTC_T13CKI_MASK                        equ 0040h
PORTC_T1OSCO_POSN                        equ 0007h
PORTC_T1OSCO_POSITION                    equ 0007h
PORTC_T1OSCO_SIZE                        equ 0001h
PORTC_T1OSCO_LENGTH                      equ 0001h
PORTC_T1OSCO_MASK                        equ 0080h
PORTC_VREFP_POSN                         equ 0000h
PORTC_VREFP_POSITION                     equ 0000h
PORTC_VREFP_SIZE                         equ 0001h
PORTC_VREFP_LENGTH                       equ 0001h
PORTC_VREFP_MASK                         equ 0001h
PORTC_VREFM_POSN                         equ 0001h
PORTC_VREFM_POSITION                     equ 0001h
PORTC_VREFM_SIZE                         equ 0001h
PORTC_VREFM_LENGTH                       equ 0001h
PORTC_VREFM_MASK                         equ 0002h
PORTC_CVREF_POSN                         equ 0002h
PORTC_CVREF_POSITION                     equ 0002h
PORTC_CVREF_SIZE                         equ 0001h
PORTC_CVREF_LENGTH                       equ 0001h
PORTC_CVREF_MASK                         equ 0004h
PORTC_T1OSCI_POSN                        equ 0006h
PORTC_T1OSCI_POSITION                    equ 0006h
PORTC_T1OSCI_SIZE                        equ 0001h
PORTC_T1OSCI_LENGTH                      equ 0001h
PORTC_T1OSCI_MASK                        equ 0040h
PORTC_P1D_POSN                           equ 0002h
PORTC_P1D_POSITION                       equ 0002h
PORTC_P1D_SIZE                           equ 0001h
PORTC_P1D_LENGTH                         equ 0001h
PORTC_P1D_MASK                           equ 0004h
PORTC_P1C_POSN                           equ 0003h
PORTC_P1C_POSITION                       equ 0003h
PORTC_P1C_SIZE                           equ 0001h
PORTC_P1C_LENGTH                         equ 0001h
PORTC_P1C_MASK                           equ 0008h
PORTC_P1B_POSN                           equ 0004h
PORTC_P1B_POSITION                       equ 0004h
PORTC_P1B_SIZE                           equ 0001h
PORTC_P1B_LENGTH                         equ 0001h
PORTC_P1B_MASK                           equ 0010h
PORTC_P1A_POSN                           equ 0005h
PORTC_P1A_POSITION                       equ 0005h
PORTC_P1A_SIZE                           equ 0001h
PORTC_P1A_LENGTH                         equ 0001h
PORTC_P1A_MASK                           equ 0020h
PORTC_SS_POSN                            equ 0006h
PORTC_SS_POSITION                        equ 0006h
PORTC_SS_SIZE                            equ 0001h
PORTC_SS_LENGTH                          equ 0001h
PORTC_SS_MASK                            equ 0040h
PORTC_SDO_POSN                           equ 0007h
PORTC_SDO_POSITION                       equ 0007h
PORTC_SDO_SIZE                           equ 0001h
PORTC_SDO_LENGTH                         equ 0001h
PORTC_SDO_MASK                           equ 0080h
PORTC_CCP2_POSN                          equ 0001h
PORTC_CCP2_POSITION                      equ 0001h
PORTC_CCP2_SIZE                          equ 0001h
PORTC_CCP2_LENGTH                        equ 0001h
PORTC_CCP2_MASK                          equ 0002h
PORTC_PA1_POSN                           equ 0002h
PORTC_PA1_POSITION                       equ 0002h
PORTC_PA1_SIZE                           equ 0001h
PORTC_PA1_LENGTH                         equ 0001h
PORTC_PA1_MASK                           equ 0004h
PORTC_PA2_POSN                           equ 0001h
PORTC_PA2_POSITION                       equ 0001h
PORTC_PA2_SIZE                           equ 0001h
PORTC_PA2_LENGTH                         equ 0001h
PORTC_PA2_MASK                           equ 0002h

